export default {
  projections: {
    ЗаказE: {
      дата: {
        __caption__: 'Дата'
      },
      номерЗаказа: {
        __caption__: 'Номер заказа'
      },
      клиент: {
        __caption__: 'Клиент',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      менеджер: {
        __caption__: 'Менеджер',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      доставка: {
        __caption__: 'Доставка',
        типДоставки: {
          __caption__: 'Тип доставки'
        }
      },
      оплата: {
        __caption__: 'Табличная часть оплата',
        способ: {
          __caption__: 'Способ'
        },
        дата: {
          __caption__: 'Дата'
        },
        сумма: {
          __caption__: 'Сумма'
        }
      }
    },
    ЗаказL: {
      дата: {
        __caption__: 'Дата'
      },
      номерЗаказа: {
        __caption__: 'Номер заказа'
      },
      клиент: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      менеджер: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      доставка: {
        __caption__: 'Тип доставки',
        типДоставки: {
          __caption__: 'Тип доставки'
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    номерЗаказа: {
      __caption__: 'Номер заказа'
    },
    доставка: {
      __caption__: 'Доставка'
    },
    клиент: {
      __caption__: 'Клиент'
    },
    менеджер: {
      __caption__: 'Менеджер'
    },
    оплата: {
      __caption__: 'Табличная часть оплата'
    }
  }
};
